{
  "model_type": "llama",
  "architectures": ["LlamaForCausalLM"],
  "hidden_size": 256,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 4,
  "intermediate_size": 512,
  "vocab_size": 32000,
  "rope_theta": 10000.0,
  "rms_norm_eps": 1e-6,
  "torch_dtype": "float16"
}
